# Assignment 1

## Task - 1 Create a pandas dataframe (DataFrame name as 'df') (10 observation and 5 features)

In [1]:
import numpy as np
import pandas as pd

In [2]:
m = {'id_no':[1,2,3,4,5,6,7,8,9,10],
    'Name':["David","Hazle","Priyanshu","Charles","Catherine","Mathew","Alexia","Ashiq","Churnika","Ryan"],
    'Age':[50,19,np.nan,17,25,45,36,25,60,np.nan],
    'Gender':['M','F','M','M','F','M','F','M','F','M'],
    'No of Cars':[2,1,2,3,1,1,2,1,2,1],
    'Favourite Colour':["Blue","Purple","Black","Violet","Red","Navy Blue","Pink","Black","Indigo","White"]}

In [3]:
df = pd.DataFrame(m)

In [4]:
print(df)

   id_no       Name   Age Gender  No of Cars Favourite Colour
0      1      David  50.0      M           2             Blue
1      2      Hazle  19.0      F           1           Purple
2      3  Priyanshu   NaN      M           2            Black
3      4    Charles  17.0      M           3           Violet
4      5  Catherine  25.0      F           1              Red
5      6     Mathew  45.0      M           1        Navy Blue
6      7     Alexia  36.0      F           2             Pink
7      8      Ashiq  25.0      M           1            Black
8      9   Churnika  60.0      F           2           Indigo
9     10       Ryan   NaN      M           1            White

##  Task- 2 Check the info of 'df'

In [5]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 6 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   id_no             10 non-null     int64
 1   Name              10 non-null     object
 2   Age               8 non-null      float64
 3   Gender            10 non-null     object
 4   No of Cars        10 non-null     int64
 5   Favourite Colour  10 non-null     object
dtypes: float64(1), int64(2), object(3)
memory usage: 608.0+ bytes

## Task 3- Check the descriptive statistics of 'df'

In [6]:
df.describe()

          id_no       Age  No of Cars
count  10.00000   8.00000   10.000000
mean    5.50000  34.62500    1.600000
std     3.02765  15.72021    0.699206
min     1.00000  17.00000    1.000000
25%     3.25000  23.50000    1.000000
50%     5.50000  30.50000    1.500000
75%     7.75000  46.25000    2.000000
max    10.00000  60.00000    3.000000

## Task 4- check the 4th index observation with 'loc' slicing operator

In [7]:
df.loc[4]

id_no                       5
Name                Catherine
Age                      25.0
Gender                      F
No of Cars                  1
Favourite Colour          Red
Name: 4, dtype: object

## Task 5 - Check the null values in your 'df'

In [8]:
df.isnull().any()

id_no               False
Name                False
Age                  True
Gender              False
No of Cars          False
Favourite Colour    False
dtype: bool

In [9]:
df.isnull()

   id_no   Name    Age  Gender  No of Cars  Favourite Colour
0  False  False  False   False       False             False
1  False  False  False   False       False             False
2  False  False   True   False       False             False
3  False  False  False   False       False             False
4  False  False  False   False       False             False
5  False  False  False   False       False             False
6  False  False  False   False       False             False
7  False  False  False   False       False             False
8  False  False  False   False       False             False
9  False  False   True   False       False             False